Project/Toir/src/Catalogs/Классы/Классы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Классы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ВидыТехОпераций</name>
      <description>Виды тех.операции</description>
    </items>
    <items>
      <name>ВложенныеТехКарты</name>
      <description>Вложенные тех карты</description>
    </items>
    <items>
      <name>КлассыТехКарт</name>
      <description>Классы тех. карт</description>
    </items>
    <items>
      <name>СтрокиТехОпераций</name>
      <description>Строки тех.операций</description>
    </items>
    <items>
      <name>ТехнологическиеКарты</name>
      <description>Технологические карты</description>
    </items>
    <items>
      <name>ТипыТехКарт</name>
      <description>Типы тех. карт</description>
    </items>
    <items>
      <name>Оборудование</name>
      <description>Оборудование</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбъектовНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьВИерархииТО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАтрибута</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураКласса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектыНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассТабличнаяЧасть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКодаКласса</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматКодаКласса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНаименованияКласса</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКодаНоменклатуры</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматКодаНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНаименованияНоменклатуры</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКодаОбъекта</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматКодаОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНаименованияОбъекта</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикКлассов</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикНоменклатуры</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикОбъектовНоменклатуры</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоСчетчику</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШагСчетчика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрисвоенНомерПоШаблону</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимКонтроляДублейПоНаименованию</name>
    <type>
      <types>EnumRef.РежимыКонтроляДублей</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольДублейВПределахКласса</name>
    <type>
      <types>CatalogRef.Классы</types>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/Catalogs/Классы/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.НоменклатураКласса.Доступность    = НЕ Объект.КлассТабличнаяЧасть;
	Элементы.ЗначениеАтрибута.Доступность      = НЕ Объект.КлассТабличнаяЧасть;
	Элементы.ОбъектыНоменклатуры.Доступность   = Объект.НоменклатураКласса;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураКлассаПриИзменении(Элемент)
	
	Элементы.ОбъектыНоменклатуры.Доступность = Объект.НоменклатураКласса;
	
КонецПроцедуры

&НаКлиенте
Процедура КлассТабличнаяЧастьПриИзменении(Элемент)
	
	Элементы.НоменклатураКласса.Доступность    = НЕ Объект.КлассТабличнаяЧасть;
	Элементы.ЗначениеАтрибута.Доступность      = НЕ Объект.КлассТабличнаяЧасть;
	Если Объект.КлассТабличнаяЧасть Тогда
		Объект.ЗначениеАтрибута   = Ложь;
		Объект.НоменклатураКласса = Истина;
		Элементы.ОбъектыНоменклатуры.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры
